      ***************************************************************
      *    PROGRAM MESSAGE         ---   FOR MESSAGES               *
      *                                      DISPLAYS               *
      *                                      PRINTS                 *
      *                                      DUMPS      ETC...      *
      *                                                             *
      *  COPY WKREFPGM REPLACING SPACE BY "aCBxxyyy*v*".            *
      ***************************************************************
       01  REF-PGM    VALUE SPACE.
           05  PGM             PIC X(8).
           05  FILLER          PIC X.
           05  VERSION         PIC X.
           05  FILLER          PIC X.
