     C*
     C/exec sql
     C+ drop table demo_sql/custmast
     C/end-exec
     C*
     C                   seton                                        lr
