     DMultiplica       PR            20P 5
     DFacteur1                       15P 5
     DFacteur2                       15P 5
     Ddivide           PR            20P 5
     DFacteur1                       15P 5
     DFacteur2                       15P 5
     DRemainder                      15P 5 OPTIONS(*NOPASS)
