     HNOMAIN
      /COPY MOD002_P
     P Addition        B                   EXPORT
     D                 PI            15P 5
     DFacteur1                       15P 5
     DFacteur2                       15P 5
     D*
     DResultat         S             15P 5
     C                   EVAL      Resultat = Facteur1 + Facteur2
     C                   return    Resultat
     P Addition        E
