     D
     D*------------------------------------------------------------------------
     D* Prototype for procedure SMK28X1 in CLLE
     D*------------------------------------------------------------------------
     D SMK28X1         Pr
     D*
     D e_SysValNam                   10a
     D e_Value                     5000a
     D*--------
 
