     D*------------------------------------------------------------------------
     D* Get_RandInt : get a random integer
     D*------------------------------------------------------------------------
     D Get_RandInt     Pr            10i 0
     D  e_IntMax                     10i 0 Value
     D
 
