     D*------------------------------------------------------------------------
     D* Prototypes for Procedures for UpperCase/LowerCase Strings
     D*------------------------------------------------------------------------
     D*------------------------------------------------------------------------
     D* Str_ToUpper : Convert a string to Uppercase
     D*     (max length = 100 char)
     D*------------------------------------------------------------------------
     D Str_ToUpper     Pr           100A
     D e_String                     100a   Const
     D*--------
     D*------------------------------------------------------------------------
     D* Str_ToLower : Convert a string to Uppercase
     D*     (max length = 100 char)
     D*------------------------------------------------------------------------
     D Str_ToLower     Pr           100A
     D e_String                     100a   Const
     D*--------
     D*------------------------------------------------------------------------
     D* Str_isUpper : Check whether a String is only in UpperCase
     D*------------------------------------------------------------------------
     D Str_isUpper     Pr             1N
     D e_String                     100a   Const
     D*--------
     D*------------------------------------------------------------------------
     D* Str_isLower : Check whether a String is only in UpperCase
     D*------------------------------------------------------------------------
     D Str_isLower     Pr             1N
     D e_String                     100a   Const
     D*--------
