      *------------------------------------------------------------------------
      * Protototype of Procedures to handle  "Pck" values
      *------------------------------------------------------------------------
     D*------------------------------------------------------------------------
     D* Get_PckMin : get the minimum value from 2,3 or 4 Pck
     D*
     D*------------------------------------------------------------------------
     D Get_PckMin      Pr            30p 9
     D e_Pck1                        30p 9 Value
     D e_Pck2                        30p 9 Value
     D e_Pck3                        30p 9 Value
     D                                     Options(*Nopass)
     D e_Pck4                        30p 9 Value
     D                                     Options(*Nopass)
     D*------------------------------------------------------------------------
     D* Get_PckMax : get the maximum value from 2,3 or 4 Pck
     D*------------------------------------------------------------------------
     D Get_PckMax      Pr            30p 9
     D e_Pck1                        30p 9 Value
     D e_Pck2                        30p 9 Value
     D e_Pck3                        30p 9 Value
     D                                     Options(*Nopass)
     D e_Pck4                        30p 9 Value
     D                                     Options(*Nopass)
