000100020131PGM
000200030704             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) VALUE('TH_SMPL')
000300030704             CPYF       FROMFILE(ARTICLE) TOFILE(&LIB/ARTICLESAV)
000400170801/* makingCHANnges */
000500020131ENDPGM
