000100080507     C*
000200080507     C/exec sql
000300080507     C+ create table demo_sql/custmast
000400080507     C+ ( cuid char(5) not null with default ,
000500080507     C+   cuname char(10) not null with default )
000600080507     C/end-exec
000700080507     C*
000800080507     C                   seton                                        lr
