000100080507     C*
000200080507     C/exec sql
000300080507     C+ drop table demo_sql/custmast
000400080507     C/end-exec
000500080507     C*
000600080507     C                   seton                                        lr
